Revit 2027 API
BuiltInFailures.SculptingFailures Class
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.SculptingFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class SculptingFailures
Public NotInheritable Class SculptingFailures
public ref class SculptingFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type SculptingFailures = class end
The BuiltInFailures.SculptingFailures type exposes the following members.
Properties
Name | Description
FaceSculptingFaceLoss |  The original sculpted face is lost.
Top
See Also
Reference
Autodesk.Revit.DB Namespace